#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ChrisWilding/terraform-github/runs/run-aQXc7gTXFTaVRs8B

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...
github_repository.curriculum_vitae: Refreshing state... [id=curriculum-vitae]
github_repository.pact_broker: Refreshing state... [id=pact-broker]
github_repository.dlog: Refreshing state... [id=dlog]
github_repository.aws_nuke: Refreshing state... [id=aws-nuke]
github_repository.nand2tetris: Refreshing state... [id=nand2tetris]
github_repository.crawl: Refreshing state... [id=crawl]
github_repository.experiment_io_ts: Refreshing state... [id=experiment-io-ts]
github_repository.bill: Refreshing state... [id=bill]
github_repository.discography_api: Refreshing state... [id=discography-api]
github_repository.monkey: Refreshing state... [id=monkey]
github_repository.nasa: Refreshing state... [id=nasa]
github_repository.exercism_x86_64_assembly: Refreshing state... [id=exercism-x86-64-assembly]
github_repository.advent_of_code_2019: Refreshing state... [id=advent-of-code-2019]
github_repository.exercism_c: Refreshing state... [id=exercism-c]
github_repository.jinventory: Refreshing state... [id=jinventory]
github_repository.www_chriswilding_dev: Refreshing state... [id=www.chriswilding.dev]
github_repository.advent_of_code_2021: Refreshing state... [id=advent-of-code-2021]
github_repository.experiment_kafka: Refreshing state... [id=experiment-kafka]
github_repository.magidash: Refreshing state... [id=magidash]
github_repository.ginventory: Refreshing state... [id=ginventory]
github_repository.exercism_rust: Refreshing state... [id=exercism-rust]
github_repository.canvas: Refreshing state... [id=canvas]
github_repository.exercism_kotlin: Refreshing state... [id=exercism-kotlin]
github_repository.bookshelf_api: Refreshing state... [id=bookshelf-api]
github_repository.terraform_aws_secrets: Refreshing state... [id=terraform-aws-secrets]
github_repository.spring_microservices_in_action: Refreshing state... [id=spring-microservices-in-action]
github_repository.exercism_elixir: Refreshing state... [id=exercism-elixir]
github_repository.clox: Refreshing state... [id=clox]
github_repository.jlox: Refreshing state... [id=jlox]
github_repository.exercism_ocaml: Refreshing state... [id=exercism-ocaml]
github_repository.exercism_typescript: Refreshing state... [id=exercism-typescript]
github_repository.hotels: Refreshing state... [id=hotels]
github_repository.tiger_go: Refreshing state... [id=tiger-go]
github_repository.advent_of_code_2018: Refreshing state... [id=advent-of-code-2018]
github_repository.bump: Refreshing state... [id=bump]
github_repository.pact_broker_secrets: Refreshing state... [id=pact-broker-secrets]
github_repository.dotfiles: Refreshing state... [id=dotfiles]
github_repository.exercism_java: Refreshing state... [id=exercism-java]
github_repository.terraform_aws: Refreshing state... [id=terraform-aws]
github_repository.mazes_for_programmers: Refreshing state... [id=mazes-for-programmers]
github_repository.to_roman_numeral: Refreshing state... [id=to-roman-numeral]
github_repository.organisation_accounts_client: Refreshing state... [id=organisation-accounts-client]
github_repository.advent_of_code_2017: Refreshing state... [id=advent-of-code-2017]
github_repository.experiment_aurora_lambda: Refreshing state... [id=experiment-aurora-lambda]
github_repository.merchants_guide_to_the_galaxy: Refreshing state... [id=merchants-guide-to-the-galaxy]
github_repository.go_base: Refreshing state... [id=go-base]
github_repository.tiger_ocaml: Refreshing state... [id=tiger-ocaml]
github_repository.fsa: Refreshing state... [id=fsa]
github_repository.experiment_autotag: Refreshing state... [id=experiment-autotag]
github_repository.sahi: Refreshing state... [id=sahi]
github_repository.exercism_erlang: Refreshing state... [id=exercism-erlang]
github_repository.advent_of_code_2020: Refreshing state... [id=advent-of-code-2020]
github_repository.exercism_scala: Refreshing state... [id=exercism-scala]
github_repository.terraform_github: Refreshing state... [id=terraform-github]
github_repository.exercism_mips: Refreshing state... [id=exercism-mips]
github_repository.exercism_go: Refreshing state... [id=exercism-go]
github_actions_secret.aws_access_key_id: Refreshing state... [id=aws-nuke:AWS_ACCESS_KEY_ID]
github_actions_secret.aws_secret_access_key: Refreshing state... [id=aws-nuke:AWS_SECRET_ACCESS_KEY]
github_branch_protection.crawl: Refreshing state... [id=BPR_kwDOG9mVlc4BdzBc]
github_actions_secret.heroku_api_key: Refreshing state... [id=jinventory:HEROKU_API_KEY]
github_branch_protection.jinventory: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3NDU0ODk=]
github_actions_secret.magidash_heroku_api_key: Refreshing state... [id=magidash:HEROKU_API_KEY]
github_branch_protection.mazes_for_programmers: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE2NjcxMzE=]
github_branch_protection.organisation_accounts_client: Refreshing state... [id=BPR_kwDOG_uO484Bf4-u]
github_actions_secret.go_base_terraform_cloud_api_key: Refreshing state... [id=go-base:TERRAFORM_CLOUD_API_KEY]
github_branch_protection.go_base: Refreshing state... [id=BPR_kwDOG6o6fs4BdUt4]
github_actions_secret.go_base_heroku_api_key: Refreshing state... [id=go-base:HEROKU_API_KEY]
github_actions_secret.terraform_cloud_api_key: Refreshing state... [id=terraform-github:TERRAFORM_CLOUD_API_KEY]
github_branch_protection.terraform_github: Refreshing state... [id=BPR_kwDOFtzSP84BciXm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository.dlog will be destroyed
  # (because github_repository.dlog is not in configuration)
  - resource "github_repository" "dlog" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = false -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archive_on_destroy          = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - etag                        = "W/\"70b83368acd43b9c798a25589dce3f3b63c6cf90e2c095de39639ffccfc0144a\"" -> null
      - full_name                   = "chriswilding/dlog" -> null
      - git_clone_url               = "git://github.com/chriswilding/dlog.git" -> null
      - gitignore_template          = "Go" -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/chriswilding/dlog" -> null
      - http_clone_url              = "https://github.com/chriswilding/dlog.git" -> null
      - id                          = "dlog" -> null
      - is_template                 = false -> null
      - license_template            = "apache-2.0" -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "dlog" -> null
      - node_id                     = "R_kgDOHhveCA" -> null
      - private                     = false -> null
      - repo_id                     = 505142792 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:chriswilding/dlog.git" -> null
      - svn_url                     = "https://github.com/chriswilding/dlog" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
    }

  # github_repository.proglog will be created
  + resource "github_repository" "proglog" {
      + allow_auto_merge            = true
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "Go"
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + license_template            = "apache-2.0"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "proglog"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @chriswilding, Action: `pull_request`*